load-test.yml
# https://backstage.io/docs/features/software-catalog/software-catalog-api/#get-entities
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:7007
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: '/api/catalog/entities'
              headers:
                Authorization: Bearer {{ $env.LOAD_TEST_TOKEN }}
          - get:
              url: '/api/catalog/entities/by-name/component/default/backstage'
              headers:
                Authorization: Bearer {{ $env.LOAD_TEST_TOKEN }}
          - get:
              url: '/api/catalog/entities/by-name/system/should/fail'
              headers:
                Authorization: Bearer {{ $env.LOAD_TEST_TOKEN }}
          # - get:
          #     url: '/api/catalog/entities/by-name/resource/should/fail'
          #     headers:
          #       Authorization: Bearer {{ $env.LOAD_TEST_TOKEN }}
          # - get:
          #     url: '/api/catalog/entities/by-name/component/should/fail'
          #     headers:
          #       Authorization: Bearer {{ $env.LOAD_TEST_TOKEN }}
          # - get:
          #     url: '/api/catalog/entities/by-name/user/should/fail'
          #     headers:
          #       Authorization: Bearer {{ $env.LOAD_TEST_TOKEN }}
        count: 100